# Задание №2
# 1) У вас есть переменная value, тип - int. Написать тернарный оператор для переменной new_value по такому правилу:
# если value меньше 100, то new_value равно половине значения value, в противном случае - противоположне value число
value = int(input("Введите число"))
new_value = value/2 if value < 100  else new_value = value[::-1]
print(new_value)



###############################################################################
# 2) У вас есть переменная value, тип - int. Написать тернарный оператор для переменной new_value по такому правилу:
# если value меньше 100, то new_value равно 1, в противном случае - 0


###############################################################################
# 3) У вас есть переменная value, тип - int. Написать тернарный оператор для переменной new_value по такому правилу: если value меньше 100, то new_value равно True, в противном случае - False
#
# 4) У вас есть переменная my_str, тип - str. Заменить в my_str все маленькие буквы на большие.
#
# 5) У вас есть переменная my_str, тип - str. Заменить в my_str все большие буквы на маленькие.
#
# 6) У вас есть переменная my_str, тип - str. Если ее длинна меньше 5, то допишите в конец строки себя же. Пример: было - "qwer", стало - "qwerqwer". Если длинна не меньше 5, то оставить строку как есть.
#
# 7) У вас есть переменная my_str, тип - str. Если ее длинна меньше 5, то допишите в конец строки перевернутую себя же. Пример: было - "qwer", стало - "qwerrewq". Если длинна не меньше 5, то оставить строку как есть.
#
# 8) У вас есть переменная my_str, тип - str. Вывести на экран все символы из этой строки, которые являются буквой или цифрой.
#
# 9) У вас есть переменная my_str, тип - str. Вывести на экран все символы из этой строки, которые не являются буквой или цифрой.
#
# 10) У вас есть переменная my_str, тип - str. Вывести на экран все символы из этой строки, которые не являются буквой или цифрой и не пробел.
#
# ПРИМЕЧАНИЕ:
# Фраза "У вас есть переменная my_str" означает, что вы можете написать
# my_str = "Test string 123 QWE"
# или что-то подобное на свое усмотрение. Делать ввод с клавиатуры не обязательно.
